---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsStyleChanged
source: html/f3703d7b-9bbc-3e47-2cf8-d859018f29a0.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsStyleChanged Property

Indicates if the style has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsStyleChanged { get; }
```